# pandas tutorial

panda is an open source,BSD-licensed library providing high performance easy to use data structure and data analysis tools for the python programming 

 #Agenda
 what is dataframe?
 what is data series?
 diffrent operation in pandas?

In [1]:
import pandas as pd
import numpy as np

In [15]:
## playing with data frame
df=pd.DataFrame(np.arange(0,20).reshape(5,4),index=['row1','row2','row3','row4','row5'],columns=['columns1','columns2','columns3','columns4'])

In [16]:
df.head()

      columns1  columns2  columns3  columns4
row1         0         1         2         3
row2         4         5         6         7
row3         8         9        10        11
row4        12        13        14        15
row5        16        17        18        19

In [17]:
## to convert it in excel sheet 
df.to_csv('Test1.csv')

In [18]:
##accesing the elements
##1 [.loc] , 2 [.iloc]

df.loc['row1']#for only one row column we use this

columns1    0
columns2    1
columns3    2
columns4    3
Name: row1, dtype: int32

In [19]:
#if we more than 2 rows we use [iloc] its called data frame
df.iloc[:,:]

      columns1  columns2  columns3  columns4
row1         0         1         2         3
row2         4         5         6         7
row3         8         9        10        11
row4        12        13        14        15
row5        16        17        18        19

In [23]:
df.iloc[0:2,1:3]

      columns2  columns3
row1         1         2
row2         5         6

In [24]:
df.iloc[0:2,0:2]

      columns1  columns2
row1         0         1
row2         4         5

In [25]:
type(df.iloc[0:2,0:2])

pandas.core.frame.DataFrame

In [26]:
##take elemnts from column 2
df.iloc[:,1:]

      columns2  columns3  columns4
row1         1         2         3
row2         5         6         7
row3         9        10        11
row4        13        14        15
row5        17        18        19

In [28]:
##convert data frames into array
df.iloc[:,1:].values

array([[ 1,  2,  3],
       [ 5,  6,  7],
       [ 9, 10, 11],
       [13, 14, 15],
       [17, 18, 19]])

In [29]:
df.iloc[:,1:].values.shape

(5, 3)

In [30]:
##inbuilt function
df.isnull().sum()

columns1    0
columns2    0
columns3    0
columns4    0
dtype: int64

In [31]:
df

      columns1  columns2  columns3  columns4
row1         0         1         2         3
row2         4         5         6         7
row3         8         9        10        11
row4        12        13        14        15
row5        16        17        18        19

In [33]:
df['columns1'].value_counts()# to check unique value in column1

0     1
4     1
8     1
12    1
16    1
Name: columns1, dtype: int64

In [35]:
df['columns1'].unique()## they take only unique value of column 1 if they see repeated value they dont print

array([ 0,  4,  8, 12, 16])

In [36]:
df[['columns3','columns4']]# when we draw two rows or multiple column we use list[] brackets

      columns3  columns4
row1         2         3
row2         6         7
row3        10        11
row4        14        15
row5        18        19